#include <iostream>
#include<time.h>
#include<stack>

using namespace std;

int main() {
	int a[10][10] = { 0, };
	srand(time(NULL));
	int x = rand() % 10;
	int y = rand() % 10;
	stack<int>s;
	int count=0;
	
	while (1) {//브레이크가 나올 때까지 반복

		x += (rand() % 3 - 1);//움직일 수 있는 범위를 -1~1로 고정.
		y += (rand() % 3 - 1);
		if (x < 0) {//배열 범위를 벗어나면 경계선으로 벌레를 고정.
			x = 0;
		}
		else if (x > 9) {
			x = 9;
		}
		if (y < 0) {
			y = 0;
		}
		else if (y > 9) {
			y = 9;
		}
		else { 
			if (a[x][y] == 0) {
				s.push(1);//경로를 처음 지나갈 경우 스택에 데이터를 하나씩 저장.
				a[x][y] += 1;
				count += 1;
				//cout<<"벌레의 위치 :  " << "(" << x << "," << y << ")" << endl;
			}
			else {
				a[x][y] += 1;
				count += 1;
				//cout << "벌레의 위치 :  " << "(" << x << "," << y << ")" << endl;
			}
		}
		for (int i = 0; i < 10; i++) {
			for (int j = 0; j < 10; j++) {
				if (x == i && y == j)
				{
					printf("§");
				}
				else {
					printf("■");
				}
			}
			printf("\n"); 
		}
		system("cls");//화면을 클리어 시켜서 장면을 연속으로 보여주며 영상처럼 보이게

        printf("                     벌레의 현재위치: (%2d, %2d)        총 움직인 횟수: %4d\r", x,y,count);
			
		
		if (s.size()==100) {/*데이터가 총 25개 저장되었다 = 모든 경로를 다 지나왔다*/
			break; 
		}
		
	}

	cout << "----------------------------------------------------------------------------------------------------" << endl;
	cout << "                                   각 지점별 벌레가 지나간 횟수                                     " << endl;
	cout << "----------------------------------------------------------------------------------------------------" << endl;
	for (int i = 0; i < 10; i++) {
		for (int j = 0; j < 10; j++) {
			printf("점(%d,%d) :[%2d]회  ",i,j,a[i][j]);
		}
		cout << "\n----------------------------------------------------------------------------------------------------\n";
	}
}
